#include <stdio.h>
#include <locale.h>

main()
{
	setlocale(LC_CTYPE, "RUS");
	int s;
	printf("Введите целую степень\n 10^");
	scanf("%d", &s);
	switch (s)
	{
	case -12:
		printf("Множителю 10^%d соответствует приставка пико", s);
		break;
	case -9:
		printf("Множителю 10^%d соответствует приставка нано", s);
		break;
	case -6:
		printf("Множителю 10^%d соответствует приставка микро", s);
		break;
	case -3:
		printf("Множителю 10^%d соответствует приставка милли", s);
		break;
	case -1:
		printf("Множителю 10^%d соответствует приставка деци", s);
		break;
	case -2:
		printf("Множителю 10^%d соответствует приставка санти", s);
		break;
	case 1:
		printf("Множителю 10^%d соответствует приставка дека", s);
		break;
	case 2:
		printf("Множителю 10^%d соответствует приставка гекто", s);
		break;
	case 3:
		printf("Множителю 10^%d соответствует приставка кило", s);
		break;
	case 6:
		printf("Множителю 10^%d соответствует приставка мега", s);
		break;
	case 9:
		printf("Множителю 10^%d соответствует приставка гига", s);
		break;
	case 12:
		printf("Множителю 10^%d соответствует приставка тера", s);
		break;
	case 15:
		printf("Множителю 10^%d соответствует приставка пета", s);
		break;
	default:
		printf("Введенной степени не соответствует ни одна приставка системы СИ");
		break;



	}
}