#include <stdio.h>
#include <locale.h>
int main()

{
	setlocale(LC_CTYPE, "RUS");
	// Объявление переменных
	int A;
	int B;
	int C;
	printf("	ДОСТАВКА ГРУЗОВ\n==================================\n");
	// Получение значений переменных
	printf("Введите массы грузов через запятую\n");
	scanf("%d,%d,%d", &A, &B, &C);
	// Проверка условия
	if (A % 5 == 0 && B % 5 == 0 && C % 5 == 0)
		puts("Диспечерская даёт разрешение на погрузку.");
	else puts("Диспечерская не даёт разрешение на погрузку.");
	return 0;

}